Synwit-Co-Ltd/CherryUSB/port/swm341/usb_hc_swm341.c
/*
 * Copyright (c) 2022, sakumisu
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "usbh_core.h"
#include "usbh_hub.h"

#undef USB_FEATURE_REMOTE_WAKEUP
#undef USB_FEATURE_ENDPOINT_HALT
#include "SWM341.h"

/*
 * The SWM341 USB host controller executes one transaction at a time: a token
 * written to USBH.TOKEN starts a SETUP/IN/OUT transaction, the answer (ACK,
 * NAK, STALL or error) is reported through USBH.IF.RXSTAT and USBH.SR.RESP.
 * Data of at most one packet (up to 1023 bytes, TXBUF/RXBUF are 1KB) can be
 * carried by each transaction.
 *
 * This driver therefore serializes all URBs into one queue. The URB at the
 * head of the queue owns the hardware and walks through its SETUP/DATA/STATUS
 * (control) or packet-by-packet (bulk/interrupt) sequence, one token per
 * completion interrupt. On NAK the URB is rotated to the tail of the queue so
 * that a NAKing HID pipe cannot starve bulk transfers.
 */

#ifndef CONFIG_USB_SWM341_URB_NUM
#define CONFIG_USB_SWM341_URB_NUM 8
#endif

/* USBH.TOKEN.TYPE field values */
#define SWM341_TOKEN_TYPE_OUT      1
#define SWM341_TOKEN_TYPE_IN       9
#define SWM341_TOKEN_TYPE_SETUP    13

/* USBH.TOKEN.SPEED field values */
#define SWM341_TOKEN_SPEED_LOW     2
#define SWM341_TOKEN_SPEED_FULL    3

/*
 * The Synwit library only issues a token when the frame remaining counter is
 * in this window, keeping transactions away from the SOF boundary. When the
 * current position is outside the window, wait (bounded) until it re-enters.
 */
#define SWM341_FRAME_REMAIN_MIN    2000
#define SWM341_FRAME_REMAIN_MAX    10000

#define SWM341_PORT_CHANGE_MSK     (USBH_PORTSR_CONNCHG_Msk | USBH_PORTSR_ENACHG_Msk | \
                                    USBH_PORTSR_SUSPCHG_Msk | USBH_PORTSR_RSTCHG_Msk)

/* consecutive bus errors before an URB is failed */
#define SWM341_ERROR_RETRIES       3

enum swm341_ctrl_stage {
    SWM341_CTRL_STAGE_SETUP = 0,
    SWM341_CTRL_STAGE_DATA_IN,
    SWM341_CTRL_STAGE_DATA_OUT,
    SWM341_CTRL_STAGE_STATUS_IN,
    SWM341_CTRL_STAGE_STATUS_OUT,
};

struct swm341_urb_priv {
    bool inuse;
    usb_slist_t list;
    struct usbh_urb *urb;
    uint8_t stage;         /* control transfer stage, enum swm341_ctrl_stage */
    uint8_t data_toggle;  /* DATA0/DATA1 of the running non-control transfer */
    uint8_t toggle_in;    /* control transfer IN toggle */
    uint8_t toggle_out;   /* control transfer OUT toggle */
    uint8_t error_retries;
    uint16_t xfer_req;    /* bytes carried by the token in flight */
    uint32_t xfer_len;    /* bytes remaining in the current transfer/stage */
    uint8_t *xfer_buf;
    usb_osal_sem_t waitsem; /* valid while urb->timeout > 0 */
};

struct swm341_hcd {
    usb_slist_t urb_list;       /* queued URBs, the head one owns the hardware */
    volatile bool xfer_busy;    /* a token has been issued and is not answered yet */
    volatile bool xfer_abandon; /* the answered token belongs to a killed URB */
    volatile bool port_csc;     /* connect status change latch */
    volatile bool port_pec;     /* port enable change latch */
    volatile bool port_pe;      /* port enabled */
    uint8_t ep_toggle_addr[16]; /* data toggle map of non-control endpoints */
    uint8_t ep_toggle[16];
    struct swm341_urb_priv urb_pool[CONFIG_USB_SWM341_URB_NUM];
} g_swm341_hcd[CONFIG_USBHOST_MAX_BUS];

/* data toggle of non-control endpoints must survive URB resubmission */
static uint8_t swm341_toggle_get(struct swm341_hcd *hcd, uint8_t ep_addr)
{
    for (uint8_t i = 0; i < 16; i++) {
        if (hcd->ep_toggle_addr[i] == ep_addr) {
            return hcd->ep_toggle[i];
        }
    }
    return 0;
}

static void swm341_toggle_set(struct swm341_hcd *hcd, uint8_t ep_addr, uint8_t toggle)
{
    uint8_t i;

    for (i = 0; i < 16; i++) {
        if (hcd->ep_toggle_addr[i] == ep_addr) {
            break;
        }
        if (hcd->ep_toggle_addr[i] == 0xFF) {
            hcd->ep_toggle_addr[i] = ep_addr;
            break;
        }
    }
    if (i < 16) {
        hcd->ep_toggle[i] = toggle;
    }
}

static void swm341_toggle_clear(struct swm341_hcd *hcd, uint8_t ep_addr)
{
    for (uint8_t i = 0; i < 16; i++) {
        if (hcd->ep_toggle_addr[i] == ep_addr) {
            hcd->ep_toggle_addr[i] = 0xFF;
            hcd->ep_toggle[i] = 0;
        }
    }
}

static void swm341_toggle_clear_all(struct swm341_hcd *hcd)
{
    memset(hcd->ep_toggle_addr, 0xFF, sizeof(hcd->ep_toggle_addr));
    memset(hcd->ep_toggle, 0, sizeof(hcd->ep_toggle));
}

static struct swm341_urb_priv *swm341_urb_cur(struct swm341_hcd *hcd)
{
    return usb_slist_first_entry_or_null(&hcd->urb_list, struct swm341_urb_priv, list);
}

static void swm341_wait_frame_window(void)
{
    uint32_t guard = 0;
    uint32_t remain = USBH->FRAMERM;

    while ((remain >= SWM341_FRAME_REMAIN_MAX) || (remain <= SWM341_FRAME_REMAIN_MIN)) {
        /* bounded wait, window opens at latest after the next SOF */
        if (++guard > 60000u) {
            break;
        }
        remain = USBH->FRAMERM;
    }
}

static void swm341_token_send(uint8_t type, uint8_t addr, uint8_t ep,
                              uint8_t datax, uint8_t speed, uint16_t size)
{
    swm341_wait_frame_window();

    USBH->TOKEN = ((uint32_t)addr << USBH_TOKEN_ADDR_Pos) |
                  ((uint32_t)ep << USBH_TOKEN_EPNR_Pos) |
                  ((uint32_t)datax << USBH_TOKEN_DATAX_Pos) |
                  ((uint32_t)type << USBH_TOKEN_TYPE_Pos) |
                  ((uint32_t)speed << USBH_TOKEN_SPEED_Pos) |
                  ((uint32_t)size << USBH_TOKEN_TRSZ_Pos);
}

/*
 * Write one packet into the host TX FIFO.
 *
 * Two details are taken from the vendor driver (SWM341_usbh.c), which the
 * TinyUSB SWM341 hcd is also built on:
 *  - USBH->TXTRSZ is programmed before the FIFO is touched. Writing the FIFO
 *    first leaves its data port unarmed and the store raises a precise bus
 *    error, observed as BFAR = 0x40005000 = USBH->TXBUF, PC inside usb_memcpy.
 *  - the packet is written byte by byte, as every Synwit host implementation
 *    does. The FIFO accepted word stores in device mode (USBD_TxWrite uses
 *    USBD_memcpy), but keep the byte loop here since that is the only form
 *    the host FIFO is documented and exercised with.
 *
 * memcpy() is deliberately not used: usb_config.h leaves
 * CONFIG_USB_MEMCPY_DISABLE undefined, so usb_memcpy() replaces it and takes
 * its 32-bit word path whenever source and destination are both dword aligned,
 * which g_setup_buffer and ep0_request_buffer always are.
 */
static void swm341_txbuf_write(const uint8_t *src, uint16_t size)
{
    volatile uint8_t *fifo = (volatile uint8_t *)USBH->TXBUF;

    /* volatile keeps the compiler from widening this into word stores */
    for (uint16_t i = 0; i < size; i++) {
        fifo[i] = src[i];
    }
}

static void swm341_urb_next_token(struct swm341_urb_priv *priv)
{
    struct usbh_urb *urb = priv->urb;
    uint16_t mps = USB_GET_MAXPACKETSIZE(urb->ep->wMaxPacketSize);
    uint8_t speed = (urb->hport->speed == USB_SPEED_LOW) ? SWM341_TOKEN_SPEED_LOW : SWM341_TOKEN_SPEED_FULL;
    uint8_t addr = urb->hport->dev_addr;
    uint16_t size;

    if (USB_GET_ENDPOINT_TYPE(urb->ep->bmAttributes) == USB_ENDPOINT_TYPE_CONTROL) {
        switch (priv->stage) {
            case SWM341_CTRL_STAGE_SETUP:
                USBH->TXTRSZ = 8;
                swm341_txbuf_write((const uint8_t *)urb->setup, 8);
                priv->xfer_req = 8;
                swm341_token_send(SWM341_TOKEN_TYPE_SETUP, addr, 0, 0, speed, 8);
                break;
            case SWM341_CTRL_STAGE_DATA_IN:
                size = MIN(priv->xfer_len, mps);
                priv->xfer_req = size;
                swm341_token_send(SWM341_TOKEN_TYPE_IN, addr, 0, priv->toggle_in, speed, size);
                break;
            case SWM341_CTRL_STAGE_DATA_OUT:
                size = MIN(priv->xfer_len, mps);
                USBH->TXTRSZ = size;
                swm341_txbuf_write(priv->xfer_buf, size);
                priv->xfer_req = size;
                swm341_token_send(SWM341_TOKEN_TYPE_OUT, addr, 0, priv->toggle_out, speed, size);
                break;
            case SWM341_CTRL_STAGE_STATUS_IN:
                priv->xfer_req = 0;
                swm341_token_send(SWM341_TOKEN_TYPE_IN, addr, 0, priv->toggle_in, speed, 0);
                break;
            case SWM341_CTRL_STAGE_STATUS_OUT:
            default:
                USBH->TXTRSZ = 0;
                priv->xfer_req = 0;
                swm341_token_send(SWM341_TOKEN_TYPE_OUT, addr, 0, priv->toggle_out, speed, 0);
                break;
        }
    } else {
        uint8_t ep = urb->ep->bEndpointAddress & 0x0f;

        if (urb->ep->bEndpointAddress & 0x80) {
            size = MIN(priv->xfer_len, mps);
            priv->xfer_req = size;
            swm341_token_send(SWM341_TOKEN_TYPE_IN, addr, ep, priv->data_toggle, speed, size);
        } else {
            size = MIN(priv->xfer_len, mps);
            USBH->TXTRSZ = size;
            swm341_txbuf_write(priv->xfer_buf, size);
            priv->xfer_req = size;
            swm341_token_send(SWM341_TOKEN_TYPE_OUT, addr, ep, priv->data_toggle, speed, size);
        }
    }
}

/* start the next token of the queue head, must run in a critical section */
static void swm341_engine_kick(struct swm341_hcd *hcd)
{
    struct swm341_urb_priv *priv = swm341_urb_cur(hcd);

    if (priv && !hcd->xfer_busy && !hcd->xfer_abandon) {
        hcd->xfer_busy = true;
        swm341_urb_next_token(priv);
    }
}

static void swm341_urb_complete(struct swm341_hcd *hcd, struct swm341_urb_priv *priv, int errorcode)
{
    struct usbh_urb *urb = priv->urb;

    usb_slist_remove(&hcd->urb_list, &priv->list);

    if (USB_GET_ENDPOINT_TYPE(urb->ep->bmAttributes) == USB_ENDPOINT_TYPE_CONTROL) {
        /*
         * USB spec: CLEAR_FEATURE(ENDPOINT_HALT), SET_CONFIGURATION and
         * SET_INTERFACE reset the data toggle of the affected endpoints.
         */
        if ((errorcode == 0) && urb->setup) {
            struct usb_setup_packet *setup = urb->setup;

            if (((setup->bmRequestType & USB_REQUEST_TYPE_MASK) == USB_REQUEST_STANDARD) &&
                (setup->bRequest == USB_REQUEST_CLEAR_FEATURE) &&
                ((setup->bmRequestType & USB_REQUEST_RECIPIENT_MASK) == USB_REQUEST_RECIPIENT_ENDPOINT) &&
                (setup->wValue == USB_FEATURE_ENDPOINT_HALT)) {
                swm341_toggle_clear(hcd, setup->wIndex & 0x8f);
            } else if (((setup->bmRequestType & USB_REQUEST_TYPE_MASK) == USB_REQUEST_STANDARD) &&
                       ((setup->bRequest == USB_REQUEST_SET_CONFIGURATION) ||
                        (setup->bRequest == USB_REQUEST_SET_INTERFACE))) {
                swm341_toggle_clear_all(hcd);
            }
        }
    } else {
        /* remember the next expected toggle for the next submission */
        swm341_toggle_set(hcd, urb->ep->bEndpointAddress & 0x8f, priv->data_toggle);
    }

