Synwit-Co-Ltd/CherryUSB/port/swm341/usb_hc_swm341.c
    urb->errorcode = errorcode;

    if (urb->timeout > 0) {
        /* the submitting thread owns the pool slot and frees it */
        usb_osal_sem_give(priv->waitsem);
    } else {
        urb->hcpriv = NULL;
        priv->urb = NULL;
        priv->inuse = false;
    }

    if (urb->complete) {
        if (urb->errorcode < 0) {
            urb->complete(urb->arg, urb->errorcode);
        } else {
            urb->complete(urb->arg, urb->actual_length);
        }
    }
}

static void swm341_kill_all_urbs(struct swm341_hcd *hcd, int errorcode)
{
    struct swm341_urb_priv *priv;

    while ((priv = swm341_urb_cur(hcd)) != NULL) {
        if ((hcd->urb_list.next == &priv->list) && hcd->xfer_busy) {
            hcd->xfer_abandon = true;
        }
        swm341_urb_complete(hcd, priv, errorcode);
    }
}

/* process the response of the token in flight, called from the IRQ */
static void swm341_handle_response(struct swm341_hcd *hcd)
{
    struct swm341_urb_priv *priv;
    struct usbh_urb *urb;
    uint8_t resp = (USBH->SR & USBH_SR_RESP_Msk) >> USBH_SR_RESP_Pos;
    uint16_t rx_size;

    /* the RXSTAT interrupt means the token in flight has been answered */
    hcd->xfer_busy = false;

    if (hcd->xfer_abandon) {
        /* belongs to an URB killed while the token was in flight, drop it */
        hcd->xfer_abandon = false;
        swm341_engine_kick(hcd);
        return;
    }

    priv = swm341_urb_cur(hcd);
    if (priv == NULL) {
        return;
    }
    urb = priv->urb;

    switch (resp) {
        case USBR_ACK:
            priv->error_retries = 0;

            if (USB_GET_ENDPOINT_TYPE(urb->ep->bmAttributes) == USB_ENDPOINT_TYPE_CONTROL) {
                switch (priv->stage) {
                    case SWM341_CTRL_STAGE_SETUP:
                        /* data and status stages of a control transfer start from DATA1 */
                        priv->toggle_in = 1;
                        priv->toggle_out = 1;
                        if (priv->xfer_len != 0) {
                            priv->stage = (urb->setup->bmRequestType & 0x80) ? SWM341_CTRL_STAGE_DATA_IN : SWM341_CTRL_STAGE_DATA_OUT;
                        } else {
                            priv->stage = (urb->setup->bmRequestType & 0x80) ? SWM341_CTRL_STAGE_STATUS_OUT : SWM341_CTRL_STAGE_STATUS_IN;
                        }
                        break;
                    case SWM341_CTRL_STAGE_DATA_IN:
                        rx_size = (USBH->SR & USBH_SR_TRSZ_Msk) >> USBH_SR_TRSZ_Pos;
                        if (rx_size > priv->xfer_req) {
                            rx_size = priv->xfer_req;
                        }
                        memcpy(priv->xfer_buf, (uint8_t *)USBH->RXBUF, rx_size);
                        priv->xfer_buf += rx_size;
                        priv->xfer_len -= rx_size;
                        urb->actual_length += rx_size;
                        priv->toggle_in ^= 1;
                        /* short packet terminates the data stage */
                        if ((rx_size < priv->xfer_req) || (priv->xfer_len == 0)) {
                            priv->stage = SWM341_CTRL_STAGE_STATUS_OUT;
                        }
                        break;
                    case SWM341_CTRL_STAGE_DATA_OUT:
                        priv->xfer_buf += priv->xfer_req;
                        priv->xfer_len -= priv->xfer_req;
                        urb->actual_length += priv->xfer_req;
                        priv->toggle_out ^= 1;
                        if (priv->xfer_len == 0) {
                            priv->stage = SWM341_CTRL_STAGE_STATUS_IN;
                        }
                        break;
                    case SWM341_CTRL_STAGE_STATUS_IN:
                    case SWM341_CTRL_STAGE_STATUS_OUT:
                    default:
                        swm341_urb_complete(hcd, priv, 0);
                        break;
                    }
            } else {
                if (urb->ep->bEndpointAddress & 0x80) {
                    rx_size = (USBH->SR & USBH_SR_TRSZ_Msk) >> USBH_SR_TRSZ_Pos;
                    if (rx_size > priv->xfer_req) {
                        rx_size = priv->xfer_req;
                    }
                    memcpy(priv->xfer_buf, (uint8_t *)USBH->RXBUF, rx_size);
                    priv->xfer_buf += rx_size;
                    priv->xfer_len -= rx_size;
                    urb->actual_length += rx_size;
                    priv->data_toggle ^= 1;
                    if ((rx_size < priv->xfer_req) || (priv->xfer_len == 0)) {
                        swm341_urb_complete(hcd, priv, 0);
                        break;
                    }
                } else {
                    priv->xfer_buf += priv->xfer_req;
                    priv->xfer_len -= priv->xfer_req;
                    urb->actual_length += priv->xfer_req;
                    priv->data_toggle ^= 1;
                    if (priv->xfer_len == 0) {
                        swm341_urb_complete(hcd, priv, 0);
                        break;
                    }
                }
            }
            break;

        case USBR_NAK:
            priv->error_retries = 0;
            if (hcd->urb_list.next->next != NULL) {
                /* more URBs are waiting: yield the bus to them */
                usb_slist_t *node = hcd->urb_list.next;
                usb_slist_remove(&hcd->urb_list, node);
                usb_slist_add_tail(&hcd->urb_list, node);
            }
            break;

        case USBR_STALL:
            swm341_urb_complete(hcd, priv, -USB_ERR_STALL);
            break;

        default: /* CRC, stuff, toggle, timeout, ... bus errors */
            if (++priv->error_retries < SWM341_ERROR_RETRIES) {
                break; /* retry the same token */
            }
            swm341_urb_complete(hcd, priv, -USB_ERR_IO);
            break;
    }

    swm341_engine_kick(hcd);
}

static int usbh_reset_port(struct usbh_bus *bus, const uint8_t port)
{
    struct swm341_hcd *hcd = &g_swm341_hcd[bus->hcd.hcd_id];

    (void)port;

    hcd->port_pe = 0;
    hcd->port_pec = 0;
    swm341_toggle_clear_all(hcd);

    /* writing RESET issues a port reset pulse, hardware re-enables the port
     * and raises RSTCHG when the reset sequence is finished */
    USBH->PORTSR = USBH_PORTSR_RESET_Msk;

    for (int i = 0; i < 200; i++) {
        if (USBH->PORTSR & USBH_PORTSR_ENA_Msk) {
            break;
        }
        usb_osal_msleep(1);
    }

    usb_osal_msleep(10);

    /* clear the change flags raised by the reset */
    USBH->PORTSR = SWM341_PORT_CHANGE_MSK;

    hcd->port_pe = (USBH->PORTSR & USBH_PORTSR_ENA_Msk) ? 1 : 0;

