Synwit-Co-Ltd/CherryUSB/port/swm341/usb_hc_swm341.c
    return 0;
}

__WEAK void usb_hc_low_level_init(struct usbh_bus *bus)
{
    (void)bus;

    SYS->USBCR = 0;
    for (uint32_t i = 0; i < CyclesPerUs; i++) {
        __NOP();
    }
    SYS->USBCR |= (1 << SYS_USBCR_RST48M_Pos);
    __DSB();
    SYS->USBCR |= (1 << SYS_USBCR_RST12M_Pos);
    __DSB();
    SYS->USBCR |= (1 << SYS_USBCR_RSTPLL_Pos);
    __DSB();
    for (uint32_t i = 0; i < CyclesPerUs; i++) {
        __NOP();
    }

    SYS->USBCR &= ~SYS_USBCR_ROLE_Msk;
    SYS->USBCR |= (2 << SYS_USBCR_ROLE_Pos); /* host role */

    SYS->USBCR |= (1 << SYS_USBCR_VBUS_Pos);

    SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_USB_Pos);
}

__WEAK void usb_hc_low_level_deinit(struct usbh_bus *bus)
{
    (void)bus;
}

int usb_hc_init(struct usbh_bus *bus)
{
    struct swm341_hcd *hcd = &g_swm341_hcd[bus->hcd.hcd_id];

    usb_hc_low_level_init(bus);

    memset(hcd, 0, sizeof(struct swm341_hcd));
    usb_slist_init(&hcd->urb_list);
    swm341_toggle_clear_all(hcd);

    for (uint8_t i = 0; i < CONFIG_USB_SWM341_URB_NUM; i++) {
        hcd->urb_pool[i].waitsem = usb_osal_sem_create(0);
    }

    USBH->CR = USBH_CR_FLUSHFF_Msk;

    USBD->DEVCR = (0 << USBD_DEVCR_DEVICE_Pos) | /* host mode */
                  (3 << USBD_DEVCR_SPEED_Pos) |
                  (1 << USBD_DEVCR_CSRDONE_Pos);

    /* clear pending flags before unmasking */
    USBH->IF = USBH_IF_RXSTAT_Msk | USBH_IF_ABVTHR_Msk | USBH_IF_BLWTHR_Msk |
               USBH_IF_SOF_Msk | USBH_IF_PORT_Msk | USBH_IF_OTG_Msk;

	NVIC_SetPriority(USB_IRQn, 5);   /* ±ØÐë²»µÍÓÚ configMAX_SYSCALL_INTERRUPT_PRIORITY */
    NVIC_EnableIRQ(USB_IRQn);

    USBH->IE = USBH_IF_RXSTAT_Msk | USBH_IF_PORT_Msk;

    /* power the port, a device attach then raises the PORT interrupt */
    USBH->PORTSR = USBH_PORTSR_POWER_Msk;

    return 0;
}

int usb_hc_deinit(struct usbh_bus *bus)
{
    struct swm341_hcd *hcd = &g_swm341_hcd[bus->hcd.hcd_id];

    USBH->IE = 0;
    NVIC_DisableIRQ(USB_IRQn);

    swm341_kill_all_urbs(hcd, -USB_ERR_SHUTDOWN);

    for (uint8_t i = 0; i < CONFIG_USB_SWM341_URB_NUM; i++) {
        usb_osal_sem_delete(hcd->urb_pool[i].waitsem);
    }

    USBH->PORTSR = USBH_PORTSR_CLRPOWER_Msk;

    usb_hc_low_level_deinit(bus);
    return 0;
}

uint16_t usbh_get_frame_number(struct usbh_bus *bus)
{
    (void)bus;
    return (uint16_t)USBH->FRAMENR;
}

int usbh_roothub_control(struct usbh_bus *bus, struct usb_setup_packet *setup, uint8_t *buf)
{
    struct swm341_hcd *hcd = &g_swm341_hcd[bus->hcd.hcd_id];
    uint8_t nports = 1; /* the SWM341 host has a single port */
    uint8_t port = setup->wIndex;
    uint32_t status;

    if (setup->bmRequestType & USB_REQUEST_RECIPIENT_DEVICE) {
        switch (setup->bRequest) {
            case HUB_REQUEST_CLEAR_FEATURE:
                switch (setup->wValue) {
                    case HUB_FEATURE_HUB_C_LOCALPOWER:
                        break;
                    case HUB_FEATURE_HUB_C_OVERCURRENT:
                        break;
                    default:
                        return -USB_ERR_INVAL;
                }
                break;
            case HUB_REQUEST_SET_FEATURE:
                switch (setup->wValue) {
                    case HUB_FEATURE_HUB_C_LOCALPOWER:
                        break;
                    case HUB_FEATURE_HUB_C_OVERCURRENT:
                        break;
                    default:
                        return -USB_ERR_INVAL;
                }
                break;
            case HUB_REQUEST_GET_STATUS:
                memset(buf, 0, 4);
                break;
            default:
                break;
        }
    } else if (setup->bmRequestType & USB_REQUEST_RECIPIENT_OTHER) {
        switch (setup->bRequest) {
            case HUB_REQUEST_CLEAR_FEATURE:
                if (!port || port > nports) {
                    return -USB_ERR_INVAL;
                }

                switch (setup->wValue) {
                    case HUB_PORT_FEATURE_ENABLE:
                        USBH->PORTSR = USBH_PORTSR_CLRENA_Msk;
                        hcd->port_pe = 0;
                        break;
                    case HUB_PORT_FEATURE_SUSPEND:
                    case HUB_PORT_FEATURE_C_SUSPEND:
                    case HUB_PORT_FEATURE_POWER:
                        break;
                    case HUB_PORT_FEATURE_C_CONNECTION:
                        USBH->PORTSR = USBH_PORTSR_CONNCHG_Msk;
                        hcd->port_csc = 0;
                        break;
                    case HUB_PORT_FEATURE_C_ENABLE:
                        USBH->PORTSR = USBH_PORTSR_ENACHG_Msk;
                        hcd->port_pec = 0;
                        break;
                    case HUB_PORT_FEATURE_C_OVER_CURREN:
                        break;
                    case HUB_PORT_FEATURE_C_RESET:
                        USBH->PORTSR = USBH_PORTSR_RSTCHG_Msk;
                        break;
                    default:
                        return -USB_ERR_INVAL;
                }
                break;
            case HUB_REQUEST_SET_FEATURE:
                if (!port || port > nports) {
                    return -USB_ERR_INVAL;
                }

                switch (setup->wValue) {
                    case HUB_PORT_FEATURE_RESET:
                        usbh_reset_port(bus, port);
                        break;
                    case HUB_PORT_FEATURE_SUSPEND:
                        /* suspend/resume not supported by this driver */
                        break;
                    case HUB_PORT_FEATURE_POWER:
                        USBH->PORTSR = USBH_PORTSR_POWER_Msk;
                        break;
                    default:
                        return -USB_ERR_INVAL;
                }
                break;
            case HUB_REQUEST_GET_STATUS:
                if (!port || port > nports) {
                    return -USB_ERR_INVAL;
                }

                status = 0;
                if (hcd->port_csc) {
                    status |= (1 << HUB_PORT_FEATURE_C_CONNECTION);
                }
                if (hcd->port_pec) {
                    status |= (1 << HUB_PORT_FEATURE_C_ENABLE);
                }

                /* the hub thread checks CONNECTION before resetting the port,
                 * so report it independently of the port enable state */
                if (USBH->PORTSR & USBH_PORTSR_CONN_Msk) {
                    status |= (1 << HUB_PORT_FEATURE_CONNECTION);
                }
                if (USBH->PORTSR & USBH_PORTSR_ENA_Msk) {
                    status |= (1 << HUB_PORT_FEATURE_ENABLE);
                    if (USBH->PORTSR & USBH_PORTSR_SPEED_Msk) {
                        status |= (1 << HUB_PORT_FEATURE_LOWSPEED);
                    }
                }

                status |= (1 << HUB_PORT_FEATURE_POWER);
                memcpy(buf, &status, 4);
                break;
            default:
                break;
        }
    }
    return 0;
}

int usbh_submit_urb(struct usbh_urb *urb)
{
    struct usbh_bus *bus;
    struct swm341_hcd *hcd;
    struct swm341_urb_priv *priv = NULL;
    size_t flags;
    int ret = 0;

    if (!urb || !urb->hport || !urb->ep || !urb->hport->bus) {
        return -USB_ERR_INVAL;
    }

    if (!urb->hport->connected) {
        return -USB_ERR_NOTCONN;
    }

    if (urb->errorcode == -USB_ERR_BUSY) {
        return -USB_ERR_BUSY;
    }

    switch (USB_GET_ENDPOINT_TYPE(urb->ep->bmAttributes)) {
        case USB_ENDPOINT_TYPE_CONTROL:
        case USB_ENDPOINT_TYPE_BULK:
        case USB_ENDPOINT_TYPE_INTERRUPT:
            break;
        case USB_ENDPOINT_TYPE_ISOCHRONOUS:
        /* fall through */
        default:
            return -USB_ERR_NOTSUPP;
    }

