Synwit-Co-Ltd/CherryUSB/port/swm341/usb_hc_swm341.c
    bus = urb->hport->bus;
    hcd = &g_swm341_hcd[bus->hcd.hcd_id];

    flags = usb_osal_enter_critical_section();
    for (uint8_t i = 0; i < CONFIG_USB_SWM341_URB_NUM; i++) {
        if (!hcd->urb_pool[i].inuse) {
            priv = &hcd->urb_pool[i];
            priv->inuse = true;
            break;
        }
    }
    usb_osal_leave_critical_section(flags);

    if (priv == NULL) {
        return -USB_ERR_NOMEM;
    }

    priv->urb = urb;
    priv->error_retries = 0;
    priv->xfer_req = 0;
    priv->xfer_buf = urb->transfer_buffer;
    priv->xfer_len = urb->transfer_buffer_length;

    if (USB_GET_ENDPOINT_TYPE(urb->ep->bmAttributes) == USB_ENDPOINT_TYPE_CONTROL) {
        priv->stage = SWM341_CTRL_STAGE_SETUP;
        priv->toggle_in = 0;
        priv->toggle_out = 0;
    } else {
        priv->data_toggle = swm341_toggle_get(hcd, urb->ep->bEndpointAddress & 0x8f);
    }

    urb->hcpriv = priv;
    urb->errorcode = -USB_ERR_BUSY;
    urb->actual_length = 0;

    flags = usb_osal_enter_critical_section();
    usb_slist_add_tail(&hcd->urb_list, &priv->list);
    swm341_engine_kick(hcd);
    usb_osal_leave_critical_section(flags);

    if (urb->timeout > 0) {
        ret = usb_osal_sem_take(priv->waitsem, urb->timeout);
        if (ret < 0) {
            urb->timeout = 0;
            usbh_kill_urb(urb);
            return -USB_ERR_TIMEOUT;
        }
        urb->timeout = 0;
        ret = urb->errorcode;

        flags = usb_osal_enter_critical_section();
        urb->hcpriv = NULL;
        priv->urb = NULL;
        priv->inuse = false;
        usb_osal_leave_critical_section(flags);
    }

    return ret;
}

int usbh_kill_urb(struct usbh_urb *urb)
{
    struct swm341_hcd *hcd;
    struct swm341_urb_priv *priv;
    size_t flags;

    if (!urb || !urb->hcpriv || !urb->hport->bus) {
        return -USB_ERR_INVAL;
    }

    hcd = &g_swm341_hcd[urb->hport->bus->hcd.hcd_id];

    flags = usb_osal_enter_critical_section();

    priv = (struct swm341_urb_priv *)urb->hcpriv;

    if ((hcd->urb_list.next == &priv->list) && hcd->xfer_busy) {
        /* the token in flight will be answered later, discard the response */
        hcd->xfer_abandon = true;
    }

    swm341_urb_complete(hcd, priv, -USB_ERR_SHUTDOWN);

    usb_osal_leave_critical_section(flags);
    return 0;
}

void USBH_IRQHandler(uint8_t busid)
{
    struct usbh_bus *bus = &g_usbhost_bus[busid];
    struct swm341_hcd *hcd = &g_swm341_hcd[bus->hcd.hcd_id];
    uint32_t intr = USBH->IF;
    uint32_t portsr;

    if (intr & USBH_IF_PORT_Msk) {
        portsr = USBH->PORTSR;

        /* write 1 to the change bits to clear them */
        USBH->PORTSR = portsr & SWM341_PORT_CHANGE_MSK;
        USBH->IF = USBH_IF_PORT_Msk;

        if (portsr & USBH_PORTSR_CONNCHG_Msk) {
            hcd->port_csc = 1;

            if (portsr & USBH_PORTSR_CONN_Msk) {
                USB_LOG_INFO("Device attached\r\n");
            } else {
                USB_LOG_INFO("Device detached\r\n");
                hcd->port_pe = 0;
                swm341_toggle_clear_all(hcd);
                swm341_kill_all_urbs(hcd, -USB_ERR_SHUTDOWN);
            }
            bus->hcd.roothub.int_buffer[0] = (1 << 1);
            usbh_hub_thread_wakeup(&bus->hcd.roothub);
        }

        if (portsr & USBH_PORTSR_ENACHG_Msk) {
            hcd->port_pec = 1;

            if (portsr & USBH_PORTSR_ENA_Msk) {
                hcd->port_pe = 1;
            } else {
                /* babble or severe bus error: transfers cannot continue */
                hcd->port_pe = 0;
                swm341_kill_all_urbs(hcd, -USB_ERR_IO);
            }
            bus->hcd.roothub.int_buffer[0] = (1 << 1);
            usbh_hub_thread_wakeup(&bus->hcd.roothub);
        }
    }

    if (intr & USBH_IF_RXSTAT_Msk) {
        USBH->IF = USBH_IF_RXSTAT_Msk;
        swm341_handle_response(hcd);
    }
}
